app/controllers/shortened_urls_controller.rb

  def create
    @short_url = ShortenedUrl.find_by(url: short_url_params[:url])
    if @short_url
      flash[:success] = "Your shortened URL is: #{shortened_url_url(@short_url)}"
      redirect_to :root
    else
      @short_url = ShortenedUrl.new(short_url_params)
      if @short_url.save
---
SELECT  "shortened_urls".* FROM "shortened_urls" WHERE "shortened_urls"."url" = $1 LIMIT $2  [["url", ""], ["LIMIT", 1]]
INSERT INTO "shortened_urls" ("url", "token", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["url", "https://google.com"], ["token", "LNP7pxm3"], ["created_at", "2018-09-10 16:43:50.980539"], ["updated_at", "2018-09-10 16:43:50.980539"]]

  def redirect_token
    @short_url = ShortenedUrl.find_by_token(params[:token])
---
SELECT  "shortened_urls".* FROM "shortened_urls" WHERE "shortened_urls"."token" = $1 LIMIT $2  [["token", "LNP7pxm3"], ["LIMIT", 1]]